In [1]:
import pandas as pd

pd.__version__

'2.2.2'

In [2]:
titanic_df = pd.read_csv("data/titanic.csv")
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
salaries_list = [
    167.6,
    235.8,
    435.7,
    321.3,
    123.9,
    496.8,
]

salaries_list

[167.6, 235.8, 435.7, 321.3, 123.9, 496.8]

In [4]:
salaries_series = pd.Series(salaries_list)
salaries_series

0    167.6
1    235.8
2    435.7
3    321.3
4    123.9
5    496.8
dtype: float64

In [5]:
print(type(salaries_series))

<class 'pandas.core.series.Series'>

In [6]:
salaries_series.to_list()

[167.6, 235.8, 435.7, 321.3, 123.9, 496.8]

In [7]:
salaries_series.to_numpy()

array([167.6, 235.8, 435.7, 321.3, 123.9, 496.8])

In [8]:
salaries_series.to_numpy().dtype

dtype('float64')

In [9]:
workers_names = [
    "Bob",
    "Alice",
    "Nick",
    "John",
    "Sam",
    "Clark",
]
workers_names

['Bob', 'Alice', 'Nick', 'John', 'Sam', 'Clark']

In [10]:
pd.Series(workers_names, name="Workers")

0      Bob
1    Alice
2     Nick
3     John
4      Sam
5    Clark
Name: Workers, dtype: object

In [11]:
salaries_series[3]

np.float64(321.3)

In [13]:
salaries = pd.Series(
    salaries_list,
    index=workers_names,
    name="Salaries",
)

salaries

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Clark    496.8
Name: Salaries, dtype: float64

In [14]:
salaries["Clark"]

np.float64(496.8)

In [15]:
salaries["Bob"]

np.float64(167.6)

In [16]:
salaries["John"]

np.float64(321.3)

In [17]:
salaries[3]

/var/folders/r0/f247yh3j4djfkghshd5yf41m0000gn/T/ipykernel_2014/140240883.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  salaries[3]

np.float64(321.3)

In [18]:
salaries.iloc[3]

np.float64(321.3)

In [19]:
salaries.index

Index(['Bob', 'Alice', 'Nick', 'John', 'Sam', 'Clark'], dtype='object')

In [20]:
salaries["Alice":"Sam"]

Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Name: Salaries, dtype: float64

In [21]:
salaries.iloc[1:4]

Alice    235.8
Nick     435.7
John     321.3
Name: Salaries, dtype: float64

In [22]:
salaries.iloc[:4]

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Name: Salaries, dtype: float64

In [23]:
salaries[:"Sam"]

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Name: Salaries, dtype: float64

In [24]:
salaries.mean()

np.float64(296.84999999999997)

In [25]:
salaries.min()

np.float64(123.9)

In [26]:
salaries.max()

np.float64(496.8)

In [27]:
salaries.median()

np.float64(278.55)

In [28]:
salaries

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Clark    496.8
Name: Salaries, dtype: float64

In [29]:
salaries.value_counts()

Salaries
167.6    1
235.8    1
435.7    1
321.3    1
123.9    1
496.8    1
Name: count, dtype: int64

In [30]:
pd.Series([1, 2, 1, 2, 2, 3, 3, 4, 1, 2, 5, 6]).value_counts()

2    4
1    3
3    2
4    1
5    1
6    1
Name: count, dtype: int64

In [31]:
pd.Series([1, 2, 1, 2, 2, 3, 3, 4, 1, 2, 5, 6]).value_counts(normalize=True)

2    0.333333
1    0.250000
3    0.166667
4    0.083333
5    0.083333
6    0.083333
Name: proportion, dtype: float64

In [32]:
s = salaries.copy()

In [34]:
s.sort_values()

Sam      123.9
Bob      167.6
Alice    235.8
John     321.3
Nick     435.7
Clark    496.8
Name: Salaries, dtype: float64

In [35]:
s

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Clark    496.8
Name: Salaries, dtype: float64

In [36]:
s == salaries

Bob      True
Alice    True
Nick     True
John     True
Sam      True
Clark    True
Name: Salaries, dtype: bool

In [37]:
s is salaries

False

In [38]:
s.sort_values(inplace=True)

In [39]:
s

Sam      123.9
Bob      167.6
Alice    235.8
John     321.3
Nick     435.7
Clark    496.8
Name: Salaries, dtype: float64

In [40]:
s == salaries

ValueError: Can only compare identically-labeled Series objects

In [41]:
s.index

Index(['Sam', 'Bob', 'Alice', 'John', 'Nick', 'Clark'], dtype='object')

In [42]:
salaries.index

Index(['Bob', 'Alice', 'Nick', 'John', 'Sam', 'Clark'], dtype='object')

In [43]:
s

Sam      123.9
Bob      167.6
Alice    235.8
John     321.3
Nick     435.7
Clark    496.8
Name: Salaries, dtype: float64

In [44]:
s.reset_index()

   index  Salaries
0    Sam     123.9
1    Bob     167.6
2  Alice     235.8
3   John     321.3
4   Nick     435.7
5  Clark     496.8

In [45]:
s.reset_index(drop=True)

0    123.9
1    167.6
2    235.8
3    321.3
4    435.7
5    496.8
Name: Salaries, dtype: float64

In [46]:
s

Sam      123.9
Bob      167.6
Alice    235.8
John     321.3
Nick     435.7
Clark    496.8
Name: Salaries, dtype: float64

In [47]:
s.reset_index(drop=True, inplace=True)

In [48]:
s

0    123.9
1    167.6
2    235.8
3    321.3
4    435.7
5    496.8
Name: Salaries, dtype: float64

In [49]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [50]:
salaries

Bob      167.6
Alice    235.8
Nick     435.7
John     321.3
Sam      123.9
Clark    496.8
Name: Salaries, dtype: float64

In [52]:
salaries.describe()

count      6.000000
mean     296.850000
std      148.459755
min      123.900000
25%      184.650000
50%      278.550000
75%      407.100000
max      496.800000
Name: Salaries, dtype: float64

In [53]:
salaries.to_json()

'{"Bob":167.6,"Alice":235.8,"Nick":435.7,"John":321.3,"Sam":123.9,"Clark":496.8}'

In [55]:
salaries.to_csv()

',Salaries\nBob,167.6\nAlice,235.8\nNick,435.7\nJohn,321.3\nSam,123.9\nClark,496.8\n'

In [56]:
salaries.to_csv(index_label="Name")

'Name,Salaries\nBob,167.6\nAlice,235.8\nNick,435.7\nJohn,321.3\nSam,123.9\nClark,496.8\n'

In [57]:
salaries.to_dict()

{'Bob': 167.6,
 'Alice': 235.8,
 'Nick': 435.7,
 'John': 321.3,
 'Sam': 123.9,
 'Clark': 496.8}

In [58]:
salaries.reset_index().to_json()

'{"index":{"0":"Bob","1":"Alice","2":"Nick","3":"John","4":"Sam","5":"Clark"},"Salaries":{"0":167.6,"1":235.8,"2":435.7,"3":321.3,"4":123.9,"5":496.8}}'

In [59]:
salaries.reset_index(name="Worker").to_json()

'{"index":{"0":"Bob","1":"Alice","2":"Nick","3":"John","4":"Sam","5":"Clark"},"Worker":{"0":167.6,"1":235.8,"2":435.7,"3":321.3,"4":123.9,"5":496.8}}'

In [60]:
salaries.reset_index().to_dict()

{'index': {0: 'Bob', 1: 'Alice', 2: 'Nick', 3: 'John', 4: 'Sam', 5: 'Clark'},
 'Salaries': {0: 167.6, 1: 235.8, 2: 435.7, 3: 321.3, 4: 123.9, 5: 496.8}}

In [61]:
workers_salaries_data = [
    {
        "name": "Bob",
        "salary": 167.6,
        "age": 18,
    },
    {
        "name": "Alice",
        "salary": 235.8,
        "age": 25,
    },
    {
        "name": "Nick",
        "salary": 435.7,
        "age": 33,
    },
    {
        "name": "John",
        "salary": 321.3,
        "age": 27,
    },
    {
        "name": "Sam",
        "salary": 123.9,
        "age": 20,
    },
    {
        "name": "Clark",
        "salary": 496.8,
        "age": 55,
    },
]

salaries_df = pd.DataFrame(workers_salaries_data)
salaries_df

    name  salary  age
0    Bob   167.6   18
1  Alice   235.8   25
2   Nick   435.7   33
3   John   321.3   27
4    Sam   123.9   20
5  Clark   496.8   55

In [62]:
salaries_df.index

RangeIndex(start=0, stop=6, step=1)

In [63]:
salaries_df["name"]

0      Bob
1    Alice
2     Nick
3     John
4      Sam
5    Clark
Name: name, dtype: object

In [64]:
salaries_df["salary"]

0    167.6
1    235.8
2    435.7
3    321.3
4    123.9
5    496.8
Name: salary, dtype: float64

In [65]:
salaries_df["age"]

0    18
1    25
2    33
3    27
4    20
5    55
Name: age, dtype: int64

In [66]:
salaries_df.iloc[0]

name        Bob
salary    167.6
age          18
Name: 0, dtype: object

In [68]:
salaries_df.loc[0]

name        Bob
salary    167.6
age          18
Name: 0, dtype: object

In [69]:
salaries_df

    name  salary  age
0    Bob   167.6   18
1  Alice   235.8   25
2   Nick   435.7   33
3   John   321.3   27
4    Sam   123.9   20
5  Clark   496.8   55

In [70]:
salaries_df.iloc[2:4]

   name  salary  age
2  Nick   435.7   33
3  John   321.3   27

In [71]:
salaries_df["name"]

0      Bob
1    Alice
2     Nick
3     John
4      Sam
5    Clark
Name: name, dtype: object

In [72]:
[n for n in salaries_df["name"]]

['Bob', 'Alice', 'Nick', 'John', 'Sam', 'Clark']

In [73]:
[n[0].lower() for n in salaries_df["name"]]

['b', 'a', 'n', 'j', 's', 'c']

In [74]:
salaries_df

    name  salary  age
0    Bob   167.6   18
1  Alice   235.8   25
2   Nick   435.7   33
3   John   321.3   27
4    Sam   123.9   20
5  Clark   496.8   55

In [75]:
salaries_df.index = [n[0].lower() for n in salaries_df["name"]]

In [76]:
salaries_df

    name  salary  age
b    Bob   167.6   18
a  Alice   235.8   25
n   Nick   435.7   33
j   John   321.3   27
s    Sam   123.9   20
c  Clark   496.8   55

In [77]:
salaries_df.loc['a']

name      Alice
salary    235.8
age          25
Name: a, dtype: object

In [78]:
salaries_df.loc['a':'j']

    name  salary  age
a  Alice   235.8   25
n   Nick   435.7   33
j   John   321.3   27

In [79]:
salaries_df.iloc[3]

name       John
salary    321.3
age          27
Name: j, dtype: object

In [80]:
salaries_df.iloc[2:5]

   name  salary  age
n  Nick   435.7   33
j  John   321.3   27
s   Sam   123.9   20

In [81]:
salaries_df

    name  salary  age
b    Bob   167.6   18
a  Alice   235.8   25
n   Nick   435.7   33
j   John   321.3   27
s    Sam   123.9   20
c  Clark   496.8   55

In [82]:
salaries_df.sort_values("name")

    name  salary  age
a  Alice   235.8   25
b    Bob   167.6   18
c  Clark   496.8   55
j   John   321.3   27
n   Nick   435.7   33
s    Sam   123.9   20

In [83]:
salaries_df.sort_values("salary")

    name  salary  age
s    Sam   123.9   20
b    Bob   167.6   18
a  Alice   235.8   25
j   John   321.3   27
n   Nick   435.7   33
c  Clark   496.8   55

In [84]:
salaries_df.sort_values("age", ascending=False)

    name  salary  age
c  Clark   496.8   55
n   Nick   435.7   33
j   John   321.3   27
a  Alice   235.8   25
s    Sam   123.9   20
b    Bob   167.6   18

In [85]:
salaries_df.to_csv()

',name,salary,age\nb,Bob,167.6,18\na,Alice,235.8,25\nn,Nick,435.7,33\nj,John,321.3,27\ns,Sam,123.9,20\nc,Clark,496.8,55\n'

In [88]:
salaries_df.to_csv(index_label="tag")

'tag,name,salary,age\nb,Bob,167.6,18\na,Alice,235.8,25\nn,Nick,435.7,33\nj,John,321.3,27\ns,Sam,123.9,20\nc,Clark,496.8,55\n'

In [89]:
print(salaries_df.to_csv(index_label="tag"))

tag,name,salary,age
b,Bob,167.6,18
a,Alice,235.8,25
n,Nick,435.7,33
j,John,321.3,27
s,Sam,123.9,20
c,Clark,496.8,55

In [90]:
salaries_df.to_csv("data/salaries.csv", index_label="tag")

In [91]:
salaries_df.to_csv("data/salaries-semi.csv", index_label="tag", sep=";")

In [92]:
pd.read_csv("data/salaries.csv")

  tag   name  salary  age
0   b    Bob   167.6   18
1   a  Alice   235.8   25
2   n   Nick   435.7   33
3   j   John   321.3   27
4   s    Sam   123.9   20
5   c  Clark   496.8   55

In [93]:
pd.read_csv("data/salaries-semi.csv")

  tag;name;salary;age
0      b;Bob;167.6;18
1    a;Alice;235.8;25
2     n;Nick;435.7;33
3     j;John;321.3;27
4      s;Sam;123.9;20
5    c;Clark;496.8;55

In [94]:
pd.read_csv("data/salaries-semi.csv", sep=";")

  tag   name  salary  age
0   b    Bob   167.6   18
1   a  Alice   235.8   25
2   n   Nick   435.7   33
3   j   John   321.3   27
4   s    Sam   123.9   20
5   c  Clark   496.8   55

In [95]:
pd.read_csv("data/salaries-semi.csv", sep=";", index_col="tag")

      name  salary  age
tag
b      Bob   167.6   18
a    Alice   235.8   25
n     Nick   435.7   33
j     John   321.3   27
s      Sam   123.9   20
c    Clark   496.8   55

In [96]:
pd.read_csv("data/salaries-semi.csv", sep=";", index_col="tag").index

Index(['b', 'a', 'n', 'j', 's', 'c'], dtype='object', name='tag')

In [97]:
salaries_df

    name  salary  age
b    Bob   167.6   18
a  Alice   235.8   25
n   Nick   435.7   33
j   John   321.3   27
s    Sam   123.9   20
c  Clark   496.8   55

In [98]:
salaries_df.index

Index(['b', 'a', 'n', 'j', 's', 'c'], dtype='object')

In [99]:
salaries_df.index.name = "tag"

In [100]:
salaries_df

      name  salary  age
tag
b      Bob   167.6   18
a    Alice   235.8   25
n     Nick   435.7   33
j     John   321.3   27
s      Sam   123.9   20
c    Clark   496.8   55

In [101]:
salaries_df == pd.read_csv("data/salaries-semi.csv", sep=";", index_col="tag")

     name  salary   age
tag
b    True    True  True
a    True    True  True
n    True    True  True
j    True    True  True
s    True    True  True
c    True    True  True

In [103]:
for idx, series in salaries_df.iterrows():
    print("idx:", idx)
    print("series:", series)

idx: b
series: name        Bob
salary    167.6
age          18
Name: b, dtype: object
idx: a
series: name      Alice
salary    235.8
age          25
Name: a, dtype: object
idx: n
series: name       Nick
salary    435.7
age          33
Name: n, dtype: object
idx: j
series: name       John
salary    321.3
age          27
Name: j, dtype: object
idx: s
series: name        Sam
salary    123.9
age          20
Name: s, dtype: object
idx: c
series: name      Clark
salary    496.8
age          55
Name: c, dtype: object

In [104]:
salaries_df.loc['a']

name      Alice
salary    235.8
age          25
Name: a, dtype: object

In [105]:
salaries_df.loc['a':'j']

      name  salary  age
tag
a    Alice   235.8   25
n     Nick   435.7   33
j     John   321.3   27

In [106]:
salaries_df.loc['a':'j', ['name', 'salary']]

      name  salary
tag
a    Alice   235.8
n     Nick   435.7
j     John   321.3

In [107]:
countries_info = {
    "country": ["Russia", "Belarus", "Ukraine", "Kazakhstan"],
    "population": [145.5, 9.3, 41.0, 19.1],
    "square": [17_075_200, 207_560, 603_628, 2_725_000],
}
countries_index = ["RU", "BY", "UA", "KZ"]

countries_df = pd.DataFrame(
    countries_info,
    index=countries_index,
)
countries_df

       country  population    square
RU      Russia       145.5  17075200
BY     Belarus         9.3    207560
UA     Ukraine        41.0    603628
KZ  Kazakhstan        19.1   2725000

In [108]:
countries_df.index.name = "code"
countries_df

         country  population    square
code
RU        Russia       145.5  17075200
BY       Belarus         9.3    207560
UA       Ukraine        41.0    603628
KZ    Kazakhstan        19.1   2725000

In [109]:
countries_df.population * 1_000_000

code
RU    145500000.0
BY      9300000.0
UA     41000000.0
KZ     19100000.0
Name: population, dtype: float64

In [110]:
countries_df.population * 1_000_000 / countries_df.square

code
RU     8.521130
BY    44.806321
UA    67.922628
KZ     7.009174
dtype: float64

In [111]:
countries_df['density'] = (
    countries_df.population * 1_000_000 / countries_df.square
)
countries_df

         country  population    square    density
code
RU        Russia       145.5  17075200   8.521130
BY       Belarus         9.3    207560  44.806321
UA       Ukraine        41.0    603628  67.922628
KZ    Kazakhstan        19.1   2725000   7.009174

In [112]:
round(8.52)

9

In [113]:
round(7.00)

7

In [114]:
countries_df['density'].apply(round)

code
RU     9
BY    45
UA    68
KZ     7
Name: density, dtype: int64

In [115]:
countries_df['density_int'] = countries_df['density'].apply(round)

In [116]:
countries_df

         country  population    square    density  density_int
code
RU        Russia       145.5  17075200   8.521130            9
BY       Belarus         9.3    207560  44.806321           45
UA       Ukraine        41.0    603628  67.922628           68
KZ    Kazakhstan        19.1   2725000   7.009174            7

In [117]:
countries_df.drop('density', axis=1)

         country  population    square  density_int
code
RU        Russia       145.5  17075200            9
BY       Belarus         9.3    207560           45
UA       Ukraine        41.0    603628           68
KZ    Kazakhstan        19.1   2725000            7

In [118]:
countries_df

         country  population    square    density  density_int
code
RU        Russia       145.5  17075200   8.521130            9
BY       Belarus         9.3    207560  44.806321           45
UA       Ukraine        41.0    603628  67.922628           68
KZ    Kazakhstan        19.1   2725000   7.009174            7

In [119]:
countries_df.drop(columns=['density'])

         country  population    square  density_int
code
RU        Russia       145.5  17075200            9
BY       Belarus         9.3    207560           45
UA       Ukraine        41.0    603628           68
KZ    Kazakhstan        19.1   2725000            7

In [120]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [121]:
titanic_df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [122]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [123]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [125]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [126]:
titanic_df.index

RangeIndex(start=0, stop=891, step=1)

In [127]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [128]:
titanic_df.Pclass

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [129]:
titanic_df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [130]:
titanic_df.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [131]:
titanic_df.Pclass.value_counts().sort_index()

Pclass
1    216
2    184
3    491
Name: count, dtype: int64

In [132]:
titanic_df.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [134]:
titanic_df.value_counts("Sex")

Sex
male      577
female    314
Name: count, dtype: int64

In [136]:
titanic_df.value_counts(["Sex", "Pclass"])

Sex     Pclass
male    3         347
female  3         144
male    1         122
        2         108
female  1          94
        2          76
Name: count, dtype: int64

In [137]:
titanic_df.value_counts(["Sex", "Pclass"]).to_frame()

               count
Sex    Pclass
male   3         347
female 3         144
male   1         122
       2         108
female 1          94
       2          76

In [139]:
titanic_df.groupby("Sex")

In [140]:
titanic_df.groupby("Sex").count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [143]:
titanic_df.groupby(["Sex", "Survived"])

In [144]:
titanic_df.groupby(["Sex", "Survived"]).count()

                 PassengerId  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex    Survived
female 0                  81      81    81   64     81     81      81    81
       1                 233     233   233  197    233    233     233   233
male   0                 468     468   468  360    468    468     468   468
       1                 109     109   109   93    109    109     109   109

                 Cabin  Embarked
Sex    Survived
female 0             6        81
       1            91       231
male   0            62       468
       1            45       109

In [146]:
titanic_df.groupby(["Sex", "Survived"])[["Age", ]].median()

                  Age
Sex    Survived
female 0         24.5
       1         28.0
male   0         29.0
       1         28.0

In [147]:
titanic_df.groupby(["Sex", "Survived"])[["Age", ]]

In [149]:
titanic_df.pivot_table(
    values=["Age"],
    index=["Sex"],
    columns=["Pclass"],
)

              Age
Pclass          1          2          3
Sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [150]:
titanic_df.pivot_table(
    values=["Age"],
    index=["Sex"],
    columns=["Pclass"],
    aggfunc="median",
)

         Age
Pclass     1     2     3
Sex
female  35.0  28.0  21.5
male    40.0  30.0  25.0

In [151]:
titanic_df.pivot_table(
    values=["Age"],
    index=["Sex", "Survived"],
    columns=["Pclass"],
    aggfunc="median",
)

                  Age
Pclass              1     2     3
Sex    Survived
female 0         25.0  32.5  22.0
       1         35.0  28.0  19.0
male   0         45.5  30.5  25.0
       1         36.0   3.0  25.0

In [152]:
titanic_df.pivot_table(
    values=["Age"],
    index=["Sex", "Survived"],
    columns=["Pclass"],
    aggfunc="mean",
)

                       Age
Pclass                   1          2          3
Sex    Survived
female 0         25.666667  36.000000  23.818182
       1         34.939024  28.080882  19.329787
male   0         44.581967  33.369048  27.255814
       1         36.248000  16.022000  22.274211